; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v8 ?v6)
             (pred_3 ?v12 ?v11)
             (pred_12 ?v8 ?v11)
             (pred_8 ?v5 ?v8 )
	     (pred_6 ?v8)
             (pred_5 ?v1)
             (pred_2 ?v12)
             (pred_1 ?v11)
             (pred_4 ?v8)
             (pred_10 ?v12)
             (pred_9 ?v8)
             (pred_7 ))



(:action op_5
:parameters (?v9 ?v10 ?v13 ?v7)
:precondition (and (pred_5 ?v9) (pred_5 ?v10) (pred_2 ?v13) (pred_1 ?v7)
          (pred_11 ?v9 ?v10) (pred_3 ?v13 ?v7)
                   (pred_12 ?v10 ?v7) (pred_6 ?v9) 
                   (pred_4 ?v10) (pred_10 ?v13))
:effect (and  (pred_9 ?v10) (not (pred_4 ?v10))))


(:action op_3
:parameters (?v9 ?v4)
:precondition (and (pred_5 ?v9) (pred_5 ?v4)
               (pred_6 ?v9) (pred_11 ?v9 ?v4) (pred_9 ?v4))
:effect (and (pred_6 ?v4) (not (pred_6 ?v9))))

(:action op_4
:parameters (?v9 ?v13)
:precondition (and (pred_5 ?v9) (pred_2 ?v13) 
                  (pred_6 ?v9) (pred_8 ?v13 ?v9) (pred_7 ))
:effect (and (pred_10 ?v13)
   (not (pred_8 ?v13 ?v9)) (not (pred_7 ))))


(:action op_1
:parameters (?v9 ?v3 ?v2)
:precondition (and (pred_5 ?v9) (pred_2 ?v3) (pred_2 ?v2)
                  (pred_6 ?v9) (pred_10 ?v2) (pred_8 ?v3 ?v9))
:effect (and (pred_10 ?v3) (pred_8 ?v2 ?v9)
        (not (pred_10 ?v2)) (not (pred_8 ?v3 ?v9))))

(:action op_2
:parameters (?v9 ?v13)
:precondition (and (pred_5 ?v9) (pred_2 ?v13) 
                  (pred_6 ?v9) (pred_10 ?v13))
:effect (and (pred_7 ) (pred_8 ?v13 ?v9) (not (pred_10 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_31 obj_02 obj_08 obj_22 obj_26 obj_13 obj_01 obj_04 obj_05 obj_07 obj_27 obj_28 obj_29 obj_17 obj_30 obj_23 obj_19 obj_11 obj_12 obj_24 obj_21 obj_09 obj_06 obj_15 obj_18
    obj_14 obj_16 obj_25
    obj_10 obj_03 obj_20
    )

    (:init
       (pred_7)

       (pred_5 obj_31)
       (pred_5 obj_02)
       (pred_5 obj_08)
       (pred_5 obj_22)
       (pred_5 obj_26)
       (pred_5 obj_13)
       (pred_5 obj_01)
       (pred_5 obj_04)
       (pred_5 obj_05)
       (pred_5 obj_07)
       (pred_5 obj_27)
       (pred_5 obj_28)
       (pred_5 obj_29)
       (pred_5 obj_17)
       (pred_5 obj_30)
       (pred_5 obj_23)
       (pred_5 obj_19)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_24)
       (pred_5 obj_21)
       (pred_5 obj_09)
       (pred_5 obj_06)
       (pred_5 obj_15)
       (pred_5 obj_18)
       (pred_1 obj_14)
       (pred_1 obj_16)
       (pred_1 obj_25)
       (pred_2 obj_10)
       (pred_2 obj_03)
       (pred_2 obj_20)

       (pred_11 obj_31 obj_13)
       (pred_11 obj_31 obj_02)
       (pred_11 obj_02 obj_01)
       (pred_11 obj_02 obj_08)
       (pred_11 obj_02 obj_31)
       (pred_11 obj_08 obj_04)
       (pred_11 obj_08 obj_22)
       (pred_11 obj_08 obj_02)
       (pred_11 obj_22 obj_05)
       (pred_11 obj_22 obj_26)
       (pred_11 obj_22 obj_08)
       (pred_11 obj_26 obj_07)
       (pred_11 obj_26 obj_22)
       (pred_11 obj_13 obj_27)
       (pred_11 obj_13 obj_01)
       (pred_11 obj_13 obj_31)
       (pred_11 obj_01 obj_28)
       (pred_11 obj_01 obj_04)
       (pred_11 obj_01 obj_02)
       (pred_11 obj_01 obj_13)
       (pred_11 obj_04 obj_29)
       (pred_11 obj_04 obj_05)
       (pred_11 obj_04 obj_08)
       (pred_11 obj_04 obj_01)
       (pred_11 obj_05 obj_17)
       (pred_11 obj_05 obj_07)
       (pred_11 obj_05 obj_22)
       (pred_11 obj_05 obj_04)
       (pred_11 obj_07 obj_30)
       (pred_11 obj_07 obj_26)
       (pred_11 obj_07 obj_05)
       (pred_11 obj_27 obj_23)
       (pred_11 obj_27 obj_28)
       (pred_11 obj_27 obj_13)
       (pred_11 obj_28 obj_19)
       (pred_11 obj_28 obj_29)
       (pred_11 obj_28 obj_01)
       (pred_11 obj_28 obj_27)
       (pred_11 obj_29 obj_11)
       (pred_11 obj_29 obj_17)
       (pred_11 obj_29 obj_04)
       (pred_11 obj_29 obj_28)
       (pred_11 obj_17 obj_12)
       (pred_11 obj_17 obj_30)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_17 obj_29)
       (pred_11 obj_30 obj_24)
       (pred_11 obj_30 obj_07)
       (pred_11 obj_30 obj_17)
       (pred_11 obj_23 obj_21)
       (pred_11 obj_23 obj_19)
       (pred_11 obj_23 obj_27)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_19 obj_11)
       (pred_11 obj_19 obj_28)
       (pred_11 obj_19 obj_23)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_29)
       (pred_11 obj_11 obj_19)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_12 obj_24)
       (pred_11 obj_12 obj_17)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_24 obj_18)
       (pred_11 obj_24 obj_30)
       (pred_11 obj_24 obj_12)
       (pred_11 obj_21 obj_09)
       (pred_11 obj_21 obj_23)
       (pred_11 obj_09 obj_06)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_09 obj_21)
       (pred_11 obj_06 obj_15)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_06 obj_09)
       (pred_11 obj_15 obj_18)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_15 obj_06)
       (pred_11 obj_18 obj_24)
       (pred_11 obj_18 obj_15)
       (pred_4 obj_18)
       (pred_4 obj_08)
       (pred_4 obj_04)
       (pred_12  obj_18 obj_14)
       (pred_12  obj_08 obj_16)
       (pred_12  obj_04 obj_25)
       (pred_9 obj_31)
       (pred_9 obj_02)
       (pred_9 obj_22)
       (pred_9 obj_26)
       (pred_9 obj_13)
       (pred_9 obj_01)
       (pred_9 obj_05)
       (pred_9 obj_07)
       (pred_9 obj_27)
       (pred_9 obj_28)
       (pred_9 obj_29)
       (pred_9 obj_17)
       (pred_9 obj_30)
       (pred_9 obj_23)
       (pred_9 obj_19)
       (pred_9 obj_11)
       (pred_9 obj_12)
       (pred_9 obj_24)
       (pred_9 obj_21)
       (pred_9 obj_09)
       (pred_9 obj_06)
       (pred_9 obj_15)

       (pred_3  obj_10 obj_14)
       (pred_3  obj_03 obj_16)
       (pred_3  obj_20 obj_25)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_03 obj_30)
       (pred_8 obj_20 obj_08)
       (pred_6 obj_30)
    )

    (:goal (and
       (pred_8 obj_10 obj_12)
       (pred_8 obj_03 obj_09)
    ))
(:constraints
  (always (not (pred_6 obj_17)))
)
)

; plan
1. (op_4 obj_30 obj_03)
   deleted: (pred_8 obj_03 obj_30) (pred_7)
   added: (pred_10 obj_03)
   goals met: 0 of 2
2. (op_3 obj_30 obj_07)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_07)
   goals met: 0 of 2
3. (op_2 obj_07 obj_03)
   deleted: (pred_10 obj_03)
   added: (pred_7) (pred_8 obj_03 obj_07)
   goals met: 0 of 2
4. (op_3 obj_07 obj_05)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_05)
   goals met: 0 of 2
5. (op_4 obj_05 obj_10)
   deleted: (pred_8 obj_10 obj_05) (pred_7)
   added: (pred_10 obj_10)
   goals met: 0 of 2
6. (op_3 obj_05 obj_07)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_07)
   goals met: 0 of 2
7. (op_3 obj_07 obj_30)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_30)
   goals met: 0 of 2
8. (op_3 obj_30 obj_24)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_24)
   goals met: 0 of 2
9. (op_3 obj_24 obj_12)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_12)
   goals met: 0 of 2
10. (op_2 obj_12 obj_10)
   deleted: (pred_10 obj_10)
   added: (pred_7) (pred_8 obj_10 obj_12)
   goals met: 1 of 2
11. (op_3 obj_12 obj_24)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_24)
   goals met: 1 of 2
12. (op_3 obj_24 obj_30)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_30)
   goals met: 1 of 2
13. (op_3 obj_30 obj_07)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_07)
   goals met: 1 of 2
14. (op_4 obj_07 obj_03)
   deleted: (pred_8 obj_03 obj_07) (pred_7)
   added: (pred_10 obj_03)
   goals met: 1 of 2
15. (op_3 obj_07 obj_30)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_30)
   goals met: 1 of 2
16. (op_3 obj_30 obj_24)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_24)
   goals met: 1 of 2
17. (op_3 obj_24 obj_12)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_12)
   goals met: 1 of 2
18. (op_3 obj_12 obj_11)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_11)
   goals met: 1 of 2
19. (op_3 obj_11 obj_19)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_19)
   goals met: 1 of 2
20. (op_3 obj_19 obj_09)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_09)
   goals met: 1 of 2
21. (op_2 obj_09 obj_03)
   deleted: (pred_10 obj_03)
   added: (pred_7) (pred_8 obj_03 obj_09)
   goals met: 2 of 2
